04_Simulation/PH_2D_RANS_kOmegaSSTx_baseline/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(6.6993512e-11 -3.0999138e-11 0 6.6666667e-11 0 6.6666667e-11)
(6.6693736e-11 -3.0999994e-11 -1.9273813e-26 6.6666667e-11 0 6.6666667e-11)
(6.4964812e-11 -3.0976634e-11 -1.9247842e-26 6.6666667e-11 0 6.6666667e-11)
(6.1838485e-11 -3.0811432e-11 -9.5748757e-27 6.6666667e-11 0 6.6666667e-11)
(5.747452e-11 -3.0310926e-11 -9.457894e-27 6.6666667e-11 0 6.6666667e-11)
(5.2242311e-11 -2.9274033e-11 -9.1248427e-27 6.6666667e-11 0 6.6666667e-11)
(4.67815e-11 -2.7627705e-11 -8.6554309e-27 6.6666667e-11 0 6.6666667e-11)
(4.2095704e-11 -2.5673603e-11 0 6.6666667e-11 0 6.6666667e-11)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform (6.6666667e-11 0 0 6.6666667e-11 0 6.6666667e-11);
    }
    hills
    {
        type            fixedValue;
        value           uniform (6.6666667e-11 0 0 6.6666667e-11 0 6.6666667e-11);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
