04_Simulation/PH_2D_RANS_kOmegaSSTx_baseline/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//momentumSource
//{
//    type            pressureGradientExplicitSource;
//    active          on;            
//    selectionMode   cellZone;           //cellSet // points //cellZone //all
//    cellZone        inletCellZone;
//
//    pressureGradientExplicitSourceCoeffs
//    {
//        fieldNames  (U);
//        Ubar        (1 0 0);
//    }
//
//}

// ************************************************************************* //
