04_Simulation/PH_2D_RANS_kOmegaSSTx_baseline/system/sampleDictUext
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat csv;

interpolationScheme cellPoint;

fields
(
    U
    k       
);

sets
(

    X3H
    {
        type        face;
        axis        y;

        start       (3 0 0);
        end         (3 5 0);
    }

    X5H
    {
        type        face;
        axis        y;

        start       (5 0 0);
        end         (5 5 0);
    }

    X7H
    {
        type        face;
        axis        y;

        start       (7 0 0);
        end         (7 5 0);
    }

);
// *********************************************************************** //
